jlpoltrack/stm32ll-lib/src/stdstm32-uartc.h
//*******************************************************
// Copyright (c) OlliW, OlliW42, www.olliw.eu
// GPL3
// https://www.gnu.org/licenses/gpl-3.0.de.html
//*******************************************************
// my stripped down UART standard library
// only ISR, no DMA, no wait and tmo rx functions, no convenience functions
//*******************************************************
// Interface:
//
// #define UARTC_USE_UART1, UARTC_USE_UART1_PA9PA10, UARTC_USE_UART1_PB6PB7, UARTC_USE_UART1_PC4PC5, UARTC_USE_UART1_PB14PB15
// #define UARTC_USE_UART2, UARTC_USE_UART2_PA2PA3, UARTC_USE_UART2_PD5PD6, UARTC_USE_UART2_PB3PB4, UARTC_USE_UART2_PA14PA15
// #define UARTC_USE_UART3, UARTC_USE_UART3_PB10PB11, UARTC_USE_UART3_PC10PC11, UARTC_USE_UART3_PB8PB9
// #define UARTC_USE_UART4, UARTC_USE_UART4_PC10PC11, UARTC_USE_UART4_PA0PA1
// #define UARTC_USE_UART5, UARTC_USE_UART5_PC12PD2
// #define UARTC_USE_UART6, UARTC_USE_UART6_PC6PC7, UARTC_USE_UART6_PG14PG9
// #define UARTC_USE_UART7, UARTC_USE_UART7_PE8PE7, UARTC_USE_UART7_PF7PF6
// #define UARTC_USE_UART8, UARTC_USE_UART8_PE1PE0
// #define UARTC_USE_LPUART1, UARTC_USE_LPUART1_PA2PA3, UARTC_USE_LPUART1_PC1PC0, UARTC_USE_LPUART1_PA9PA10, UARTC_USE_LPUART1_PB6PB7
//
// #define UARTC_BAUD
//
// #define UARTC_USE_TX
// #define UARTC_TXBUFSIZE
// #define UARTC_USE_TX_ISR
// #define UARTC_USE_TX_DMA
// #define UARTC_INVERTED
//
// #define UARTC_USE_RX
// #define UARTC_RXBUFSIZE
//
// #define UARTC_IRQ_PRIORITY
//
// #define UARTC_USE_RXERRORCOUNT
//
// #define UARTC_RX_CALLBACK_FULL(c)
// #define UARTC_TC_CALLBACK() // ATTENTION: when used, one never should trigger TC isr without a byte written to the tx buffer
//
//*******************************************************
#ifndef STDSTM32_UARTC_H
#define STDSTM32_UARTC_H
#ifdef __cplusplus
extern "C" {
#endif


//-------------------------------------------------------
// Enums
//-------------------------------------------------------
// in order to not introduce hardware dependency upstream
// we define our own enums for parity and stopbits

#ifndef UART_ENUMS
#define UART_ENUMS

typedef enum {
  XUART_PARITY_NO = LL_USART_PARITY_NONE, // XUART_xxx to avoid overlap with HAL
  XUART_PARITY_EVEN = LL_USART_PARITY_EVEN,
  XUART_PARITY_ODD = LL_USART_PARITY_ODD,
  XUART_PARITY_MAKEITU32 = UINT32_MAX,
} UARTPARITYENUM;

typedef enum {
#ifdef LL_USART_STOPBITS_0_5
  UART_STOPBIT_0_5 = LL_USART_STOPBITS_0_5, // not allowed for LPUART, and some STM32F0!
#endif
  UART_STOPBIT_1 = LL_USART_STOPBITS_1,
#ifdef LL_USART_STOPBITS_1_5
  UART_STOPBIT_1_5 = LL_USART_STOPBITS_1_5, // not allowed for LPUART, and some STM32!
#endif
  UART_STOPBIT_2 = LL_USART_STOPBITS_2,
  UART_STOPBIT_MAKEITU32 = UINT32_MAX,
} UARTSTOPBITENUM;

#endif


//-------------------------------------------------------
// Defines
//-------------------------------------------------------

#include "stdstm32-peripherals.h"

#if (defined UARTC_USE_TX_ISR) && (!defined UARTC_USE_TX)
  #error UARTC_USE_TX_ISR used without UARTC_USE_TX!
#endif
#if (defined UARTC_USE_RXERRORCOUNT) && (!defined UARTC_USE_RX)
  #error UARTC_USE_RXERRORCOUNT used without UARTC_USE_RX!
#endif

#ifdef UARTC_USE_TX_DMA
  #error UARTC_USE_TX_DMA not supported by this library!
#endif


#ifndef UARTC_BAUD
  #define UARTC_BAUD             115200UL // 9600UL
#endif


#ifdef UARTC_USE_TX_ISR
  #ifndef UARTC_TXBUFSIZE
    #define UARTC_TXBUFSIZE      256 // MUST be 2^N
  #endif
  #if UARTC_TXBUFSIZE < 2
    #error UARTC_TXBUFSIZE must be larger than 1 !
  #elif ((UARTC_TXBUFSIZE & (UARTC_TXBUFSIZE-1)) != 0)
    #error UARTC_TXBUFSIZE must be a power of 2 !
  #endif

  #define UARTC_TXBUFSIZEMASK  (UARTC_TXBUFSIZE-1)

  volatile char uartc_txbuf[UARTC_TXBUFSIZE];
  volatile uint16_t uartc_txwritepos; // pos at which the last byte was stored
  volatile uint16_t uartc_txreadpos; // pos at which the next byte is to be fetched
#endif


#ifdef UARTC_USE_RX
  #ifndef UARTC_RXBUFSIZE
    #define UARTC_RXBUFSIZE      256 //128 //MUST be 2^N
  #endif
  #if UARTC_RXBUFSIZE < 2
    #error UARTC_RXBUFSIZE must be larger than 1 !
  #elif ((UARTC_RXBUFSIZE & (UARTC_RXBUFSIZE-1)) != 0)
    #error UARTC_RXBUFSIZE must be a power of 2 !
  #endif

  #define UARTC_RXBUFSIZEMASK  (UARTC_RXBUFSIZE-1)

  volatile char uartc_rxbuf[UARTC_RXBUFSIZE];
  volatile uint16_t uartc_rxwritepos; // pos at which the last byte was stored
  volatile uint16_t uartc_rxreadpos; // pos at which the next byte is to be fetched

  #ifdef UARTC_USE_RXERRORCOUNT
  volatile uint32_t uartc_errorcnt_rxnoise;
  volatile uint32_t uartc_errorcnt_rxframe;
  volatile uint32_t uartc_errorcnt_rxoverrun;
  #endif
#endif


// catch legacy defines
#if defined UARTC_USE_UART1_REMAPPED || defined UARTC_USE_UART1_REMAPPED2
  #error REMAPPED not supported anymore!
#endif
#if defined UARTC_USE_UART2_REMAPPED || defined UARTC_USE_UART2_REMAPPED2 || defined UARTC_USE_UART2_REMAPPED3
  #error REMAPPED not supported anymore!
#endif
#if defined UARTC_USE_UART3_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UARTC_USE_UART4_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UARTC_USE_UART6_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UARTC_USE_UART7_REMAPPED
  #error REMAPPED not supported anymore!
#endif
#if defined UARTC_USE_LPUART1_REMAPPED
  #error REMAPPED not supported anymore!
#endif


#if defined UARTC_USE_UART1 || defined UARTC_USE_UART1_PA9PA10 || defined UARTC_USE_UART1_PB6PB7 || defined UARTC_USE_UART1_PC4PC5 || \
      defined UARTC_USE_UART1_PB14PB15
  #define UARTC_UARTx             USART1
  #ifdef UARTC_USE_UART1
    // user needs to specify UARTC_USE_TX_IO, UARTC_USE_RX_IO, and possibly UARTC_USE_IO_AF
  #elif defined UARTC_USE_UART1_PA9PA10
    #define UARTC_TX_IO           IO_PA9
    #define UARTC_RX_IO           IO_PA10
  #elif defined UARTC_USE_UART1_PB6PB7 // was UART1_REMAPPED
    #define UARTC_TX_IO           IO_PB6
    #define UARTC_RX_IO           IO_PB7
  #elif defined UARTC_USE_UART1_PC4PC5 // only G4 // was UART1_REMAPPED2
    #define UARTC_TX_IO           IO_PC4
    #define UARTC_RX_IO           IO_PC5
  #elif defined UARTC_USE_UART1_PB14PB15 // only C5
    #define UARTC_TX_IO           IO_PB14
    #define UARTC_RX_IO           IO_PB15
  #endif
  #ifndef STM32F0
    #define UARTC_IO_AF           IO_AF_7
  #else
    #ifdef UARTC_USE_UART1
      // user needs to specify UARTC_USE_IO_AF
    #elif defined UARTC_USE_UART1_PA9PA10
      #define UARTC_IO_AF         IO_AF_1
    #elif defined UARTC_USE_UART1_PB6PB7
      #define UARTC_IO_AF         IO_AF_0
    #else
      #error UARTC_USE_UART1 mapping not available on STM32F0 !
    #endif
  #endif
  #define UARTC_IRQn              USART1_IRQn
  #define UARTC_IRQHandler        USART1_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
  #elif defined STM32C5
    // C5: PA9/PA10 and PB6/PB7 are AF7 as set above, PB14/PB15 are AF4. the AF4 is
    // datasheet-verified on C551/C552/C562, and assumed to hold for the smaller parts.
    // PC4/PC5 is not a USART1 mapping on C5, it is USART3_RX.
    #if defined UARTC_USE_UART1_PC4PC5
      #error UARTC_USE_UART1_PC4PC5 not available on STM32C5 !
    #elif defined UARTC_USE_UART1_PB14PB15
      #undef UARTC_IO_AF
      #define UARTC_IO_AF         IO_AF_4
    #endif
  #endif

