jlpoltrack/stm32ll-lib/src/stdstm32-uartc.h
#elif defined UARTC_USE_UART2 || defined UARTC_USE_UART2_PA2PA3 || defined UARTC_USE_UART2_PD5PD6 || \
      defined UARTC_USE_UART2_PB3PB4 || defined UARTC_USE_UART2_PA14PA15 || defined UARTC_USE_UART2_PB3PA15 || \
      defined UARTC_USE_UART2_PA5PA15
  #define UARTC_UARTx             USART2
  #ifdef UARTC_USE_UART2
    // user needs to specify UARTC_USE_TX_IO, UARTC_USE_RX_IO, and possibly UARTC_USE_IO_AF
  #elif defined UARTC_USE_UART2_PA2PA3
    #define UARTC_TX_IO           IO_PA2
    #define UARTC_RX_IO           IO_PA3
  #elif defined UARTC_USE_UART2_PD5PD6 // was UART2_REMAPPED
    #define UARTC_TX_IO           IO_PD5
    #define UARTC_RX_IO           IO_PD6
  #elif defined UARTC_USE_UART2_PB3PB4 // only G4 // was UART2_REMAPPED2
    #define UARTC_TX_IO           IO_PB3
    #define UARTC_RX_IO           IO_PB4
  #elif defined UARTC_USE_UART2_PA14PA15 // only G4, F0 // ATTENTION: on G4 PA14 overlaps with SWCLK // was UART2_REMAPPED3
    #define UARTC_TX_IO           IO_PA14
    #define UARTC_RX_IO           IO_PA15
  #elif defined UARTC_USE_UART2_PB3PA15 // only G4
    #define UARTC_TX_IO           IO_PB3
    #define UARTC_RX_IO           IO_PA15
  #endif
  #ifndef STM32F0
    #define UARTC_IO_AF           IO_AF_7
  #else
    #if defined UARTC_USE_UART2
      // user needs to specify UARTC_USE_IO_AF
    #elif defined UARTC_USE_UART2_PA2PA3 || defined UARTC_USE_UART2_PA14PA15
      #define UARTC_IO_AF         IO_AF_1
    #else
      #error UARTC_USE_UART2 mapping not available on STM32F0 !
    #endif
  #endif
  #define UARTC_IRQn              USART2_IRQn
  #define UARTC_IRQHandler        USART2_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
  #elif defined STM32C5
    // C5 has USART2 only on PA2/PA3 (AF7, as set above) and PD5/PD6, and PD5/PD6 is not
    // bonded up to LQFP64. PB3/PB4 and PB3/PA15 are USART3 pins on C5, not USART2.
    #if defined UARTC_USE_UART2_PD5PD6
      #error UARTC_USE_UART2_PD5PD6 not bonded on STM32C5 packages up to LQFP64 ! use UARTC_USE_UART2_PA2PA3
    #elif defined UARTC_USE_UART2_PB3PB4 || defined UARTC_USE_UART2_PA14PA15 || \
          defined UARTC_USE_UART2_PB3PA15
      #error UARTC_USE_UART2 mapping not available on STM32C5 ! use UARTC_USE_UART2_PA2PA3
    #endif
  #endif

#elif defined UARTC_USE_UART3 || defined UARTC_USE_UART3_PB10PB11 || defined UARTC_USE_UART3_PC10PC11 || defined UARTC_USE_UART3_PB8PB9 || \
      defined UARTC_USE_UART3_PA4PA3 || defined UARTC_USE_UART3_PB3PB8
  #define UARTC_UARTx             USART3
  #if defined UARTC_USE_UART3
    // user needs to specify UARTC_USE_TX_IO, UARTC_USE_RX_IO, and possibly UARTC_USE_IO_AF
  #elif defined UARTC_USE_UART3_PB10PB11
    #define UARTC_TX_IO           IO_PB10
    #define UARTC_RX_IO           IO_PB11
  #elif defined UARTC_USE_UART3_PC10PC11 // was UART3_REMAPPED
    #define UARTC_TX_IO           IO_PC10
    #define UARTC_RX_IO           IO_PC11
  #elif defined UARTC_USE_UART3_PB8PB9 // only F3
    #define UARTC_TX_IO           IO_PB8
    #define UARTC_RX_IO           IO_PB9
  #else
  #endif
  #ifndef STM32F0
    #define UARTC_IO_AF           IO_AF_7
  #else
    #if defined UARTC_USE_UART3
      // user needs to specify UARTC_USE_IO_AF
    #elif defined defined UARTC_USE_UART3_PB10PB11 || defined UARTC_USE_UART3_PB8PB9
      #define UARTC_IO_AF         IO_AF_4
    #elif defined UARTC_USE_UART3_PC10PC11
      #define UARTC_IO_AF         IO_AF_1
    #else
      #error UARTC_USE_UART3 mapping not available on STM32F0 !
    #endif
  #endif
  #define UARTC_IRQn              USART3_IRQn
  #define UARTC_IRQHandler        USART3_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #elif defined STM32WL
    #error UART3 NOT AVAILABLE !
  #elif defined STM32F0
    #undef UARTC_IRQn
    #undef UARTC_IRQHandler
    #define UARTC_IRQn            USART3_4_IRQn
    #define UARTC_IRQHandler      USART3_4_IRQHandler
  #elif defined STM32C5
    // C5 USART3 is AF7 as set above, and only PC10/PC11 is bonded up to LQFP64.
    // PB3/PB4 is USART3 too, but on AF11, and is not offered as a mapping here.
    // the C5 parts without USART3 are caught by the CMSIS presence macro.
    #if !defined USART3
      #error UART3 NOT AVAILABLE !
    #elif defined UARTC_USE_UART3_PB10PB11
      #error UARTC_USE_UART3_PB10PB11 not available on STM32C5, PB11 is not a USART3 pin ! use UARTC_USE_UART3_PC10PC11
    #elif defined UARTC_USE_UART3_PB8PB9
      #error UARTC_USE_UART3_PB8PB9 not available on STM32C5 ! use UARTC_USE_UART3_PC10PC11
    #endif
  #endif

#elif defined UARTC_USE_UART4 || defined UARTC_USE_UART4_PC10PC11 || defined UARTC_USE_UART4_PA0PA1
  #define UARTC_UARTx             UART4
  #ifdef UARTC_USE_UART4
    // user needs to specify UARTC_USE_TX_IO, UARTC_USE_RX_IO, and possibly UARTC_USE_IO_AF
  #elif defined UARTC_USE_UART4_PC10PC11
    #define UARTC_TX_IO           IO_PC10
    #define UARTC_RX_IO           IO_PC11
  #elif defined UARTC_USE_UART4_PA0PA1 // only F7, C5 // was UART4_REMAPPED
    #define UARTC_TX_IO           IO_PA0
    #define UARTC_RX_IO           IO_PA1
  #endif
  #if defined STM32F1
    #define UARTC_IO_AF           IO_AF_DEFAULT
  #elif defined STM32F7
    #define UARTC_IO_AF           IO_AF_8
  #elif defined STM32G4
    #define UARTC_IO_AF           IO_AF_5
  #elif defined STM32C5
    #define UARTC_IO_AF           IO_AF_8
  #endif
  #define UARTC_IRQn              UART4_IRQn
  #define UARTC_IRQHandler        UART4_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
    #warning UARTC IO_AF & DMA for F3 still TODO
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
    #error UART4 NOT AVAILABLE !
  #elif defined STM32F0
    #undef UARTC_IRQn
    #undef UARTC_IRQHandler
    #define UARTC_IRQn            USART3_4_IRQn
    #define UARTC_IRQHandler      USART3_4_IRQHandler
  #elif defined STM32C5
  #endif

#elif defined UARTC_USE_UART5 || defined UARTC_USE_UART5_PC12PD2
  #define UARTC_UARTx             UART5
  #ifdef UARTC_USE_UART5
    // user needs to specify UARTC_USE_TX_IO, UARTC_USE_RX_IO, and possibly UARTC_USE_IO_AF
  #elif defined UARTC_USE_UART5_PC12PD2
    #define UARTC_TX_IO           IO_PC12
    #define UARTC_RX_IO           IO_PD2
  #endif
  #define UARTC_IRQn              UART5_IRQn
  #define UARTC_IRQHandler        UART5_IRQHandler
  #if defined STM32F1
    #define UARTC_IO_AF           IO_AF_DEFAULT
  #elif defined STM32F3
    #warning UARTC IO_AF & DMA for F3 still TODO //TODO
  #elif defined STM32F7
    #define UARTC_IO_AF           IO_AF_8
  #elif defined STM32G4
    #define UARTC_IO_AF           IO_AF_5
  #elif defined STM32C5
    #define UARTC_IO_AF           IO_AF_8
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
    #error UART5 NOT AVAILABLE !
  #endif

#elif defined UARTC_USE_UART6 || defined UARTC_USE_UART6_PC6PC7 || defined UARTC_USE_UART6_PG14PG9
  #define UARTC_UARTx             USART6
  #ifdef UARTC_USE_UART6
    // user needs to specify UARTC_USE_TX_IO, UARTC_USE_RX_IO, and possibly UARTC_USE_IO_AF
  #elif defined UARTC_USE_UART6_PC6PC7
    #define UARTC_TX_IO           IO_PC6
    #define UARTC_RX_IO           IO_PC7
  #elif defined UARTC_USE_UART6_PG14PG9 // was UART6_REMAPPED
    #define UARTC_TX_IO           IO_PG14
    #define UARTC_RX_IO           IO_PG9
  #endif
  #define UARTC_IO_AF             IO_AF_8
  #define UARTC_IRQn              USART6_IRQn
  #define UARTC_IRQHandler        USART6_IRQHandler

